In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("bengaluru_house_prices.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df.isnull().any()

area_type       False
availability    False
location         True
size             True
society          True
total_sqft      False
bath             True
balcony          True
price           False
dtype: bool

In [4]:
df.shape

(13320, 9)

In [5]:
df.location.count()

13319

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
area_type       13320 non-null object
availability    13320 non-null object
location        13319 non-null object
size            13304 non-null object
society         7818 non-null object
total_sqft      13320 non-null object
bath            13247 non-null float64
balcony         12711 non-null float64
price           13320 non-null float64
dtypes: float64(3), object(6)
memory usage: 936.6+ KB

In [8]:
df1=df.copy()

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
area_type       13320 non-null object
availability    13320 non-null object
location        13319 non-null object
size            13304 non-null object
society         7818 non-null object
total_sqft      13320 non-null object
bath            13247 non-null float64
balcony         12711 non-null float64
price           13320 non-null float64
dtypes: float64(3), object(6)
memory usage: 936.6+ KB

In [15]:
df1.drop(columns=['society'],axis=1)
df1.shape

(13320, 9)

In [16]:
df1=df1.drop(['society'],axis=1)

In [17]:
df1.shape

(13320, 8)

In [18]:
df1.columns

Index(['area_type', 'availability', 'location', 'size', 'total_sqft', 'bath',
       'balcony', 'price'],
      dtype='object')

In [19]:
df1.area_type.unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [20]:
df1.availability.unique()

array(['19-Dec', 'Ready To Move', '18-May', '18-Feb', '18-Nov', '20-Dec',
       '17-Oct', '21-Dec', '19-Sep', '20-Sep', '18-Mar', '20-Feb',
       '18-Apr', '20-Aug', '18-Oct', '19-Mar', '17-Sep', '18-Dec',
       '17-Aug', '19-Apr', '18-Jun', '22-Dec', '22-Jan', '18-Aug',
       '19-Jan', '17-Jul', '18-Jul', '21-Jun', '20-May', '19-Aug',
       '18-Sep', '17-May', '17-Jun', '21-May', '18-Jan', '20-Mar',
       '17-Dec', '16-Mar', '19-Jun', '22-Jun', '19-Jul', '21-Feb',
       'Immediate Possession', '19-May', '17-Nov', '20-Oct', '20-Jun',
       '19-Feb', '21-Oct', '21-Jan', '17-Mar', '17-Apr', '22-May',
       '19-Oct', '21-Jul', '21-Nov', '21-Mar', '16-Dec', '22-Mar',
       '20-Jan', '21-Sep', '21-Aug', '14-Nov', '19-Nov', '15-Nov',
       '16-Jul', '15-Jun', '17-Feb', '20-Nov', '20-Jul', '16-Sep',
       '15-Oct', '15-Dec', '16-Oct', '22-Nov', '15-Aug', '17-Jan',
       '16-Nov', '20-Apr', '16-Jan', '14-Jul'], dtype=object)

In [37]:
df1.size

AttributeError: 'int' object has no attribute 'size'

In [31]:
df1.shape

(13320, 7)

In [32]:
df1.columns

Index(['area_type', 'location', 'size', 'total_sqft', 'bath', 'balcony',
       'price'],
      dtype='object')

In [36]:
df1.columns

AttributeError: 'int' object has no attribute 'columns'

In [38]:
df2=df.copy()

In [39]:
df2.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [40]:
df2.shape

(13320, 9)

In [43]:
df2=df.drop(['area_type','availability','society','balcony'],axis=1)

In [45]:
df2.shape

(13320, 5)

In [46]:
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [47]:
df2.isnull().any()

location       True
size           True
total_sqft    False
bath           True
price         False
dtype: bool

In [49]:
# df2.dropna()

In [50]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [51]:
df3=df2.dropna()

In [52]:
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [53]:
df3.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [55]:
df3['bhk']=df3['size'].apply(lambda x: int(x.split(" ")[0]))

C:\Users\asifk\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [59]:
df3['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [61]:
df3=df3.drop(['size'],axis=1)

In [62]:
df3.head()

                   location total_sqft  bath   price  bhk
0  Electronic City Phase II       1056   2.0   39.07    2
1          Chikka Tirupathi       2600   5.0  120.00    4
2               Uttarahalli       1440   2.0   62.00    3
3        Lingadheeranahalli       1521   3.0   95.00    3
4                  Kothanur       1200   2.0   51.00    2

In [63]:
df3.shape

(13246, 5)

In [64]:
df3.bath.unique()

array([ 2.,  5.,  3.,  4.,  6.,  1.,  9.,  8.,  7., 11., 10., 14., 27.,
       12., 16., 40., 15., 13., 18.])

In [65]:
from scipy import stats

In [69]:
# r=np.abs(stats.zscore(df3._get_numeric_data()))
# print(r)
# df4=df3[(r<3).all(axis=1)]
# df4.shape

In [70]:
df3.bhk.unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [72]:
# df3.total_sqft

In [77]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [78]:
df3[~df3['total_sqft'].apply(is_float)].head(10)

               location      total_sqft  bath    price  bhk
30            Yelahanka     2100 - 2850   4.0  186.000    4
122              Hebbal     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar     1042 - 1105   2.0   54.005    2
165            Sarjapur     1145 - 1340   2.0   43.490    2
188            KR Puram     1015 - 1540   2.0   56.800    2
410             Kengeri  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road     1195 - 1440   2.0   63.770    2
648             Arekere       4125Perch   9.0  265.000    9
661           Yelahanka     1120 - 1145   2.0   48.130    2
672        Bettahalsoor     3090 - 5002   4.0  445.000    4

In [81]:
def sfqt_average(x):
    tokens=x.split("-")
    if len(tokens)==2:
        (float(tokens[0])-float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [82]:
df4=df3.copy()

In [83]:
df4['total_sqft']=df4['total_sqft'].apply(sfqt_average)

In [85]:
df4.head(2)

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4

In [86]:
df4=df4[df4['total_sqft'].notnull()]
df4.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [88]:
df4['price_per_sqft']=df4['price']*100000/df4['total_sqft']

In [89]:
df4.head()

                   location  total_sqft  bath   price  bhk  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000

In [91]:
df5=df4.copy()
df5.to_csv("bang_house_price.csv",index=False)

In [99]:
location=df5.location.value_counts(ascending=False)
location

Whitefield                            518
Sarjapur  Road                        386
Electronic City                       304
Kanakpura Road                        260
Thanisandra                           225
Yelahanka                             203
Uttarahalli                           185
Marathahalli                          175
Hebbal                                172
Raja Rajeshwari Nagar                 171
7th Phase JP Nagar                    148
Hennur Road                           148
Bannerghatta Road                     145
Haralur Road                          141
Electronic City Phase II              129
Rajaji Nagar                          105
Chandapura                             96
Bellandur                              96
Electronics City Phase 1               86
KR Puram                               84
Hoodi                                  84
Begur Road                             82
Yeshwanthpur                           82
Kasavanhalli                           79
Harlur                                 77
Sarjapur                               75
Banashankari                           74
Ramamurthy Nagar                       72
Kengeri                                72
Koramangala                            72
                                     ...
Jayanagar,                              1
Housing Board Layout Vijay Nagar        1
1Kasavanhalli                           1
rr nagar                                1
Harohalli                               1
Haralur Road,                           1
Somanna Garden                          1
Puttappa Layout                         1
Jakkasandra                             1
Fraser town                             1
Vidya Nagar                             1
Rahmath Nagar                           1
kg halli jalhalli west                  1
P Krishnappa Layout                     1
Vidyapeeta                              1
SARJAPUR BAGALUR ROAD                   1
J P Nagar 7th Phase Ramayya City        1
Basvasamithi Layout Vidyaranyapura      1
Thirumalashettyhally                    1
MRCR Layout                             1
Subbannaiah Palya                       1
Bapuji Nagar                            1
Thyagraj Nagar                          1
Sadahalli                               1
Jogupalya                               1
T K Reddy Layout                        1
Hal old airport road                    1
Banaswadi,                              1
BDS Layout                              1
Whietfield,                             1
Name: location, Length: 1287, dtype: int64

In [100]:
df5.location=df5.location.apply(lambda x: x.strip())
location=df5.location.value_counts(ascending=False)
location

Whitefield                            518
Sarjapur  Road                        386
Electronic City                       304
Kanakpura Road                        260
Thanisandra                           225
Yelahanka                             203
Uttarahalli                           185
Marathahalli                          175
Hebbal                                172
Raja Rajeshwari Nagar                 171
7th Phase JP Nagar                    148
Hennur Road                           148
Bannerghatta Road                     145
Haralur Road                          141
Electronic City Phase II              129
Rajaji Nagar                          105
Chandapura                             96
Bellandur                              96
Electronics City Phase 1               86
KR Puram                               84
Hoodi                                  84
Begur Road                             82
Yeshwanthpur                           82
Kasavanhalli                           79
Harlur                                 77
Sarjapur                               75
Banashankari                           74
Ramamurthy Nagar                       72
Kengeri                                72
Koramangala                            72
                                     ...
Jayanagar,                              1
Housing Board Layout Vijay Nagar        1
1Kasavanhalli                           1
rr nagar                                1
Harohalli                               1
Haralur Road,                           1
Somanna Garden                          1
Puttappa Layout                         1
Jakkasandra                             1
Fraser town                             1
Vidya Nagar                             1
Rahmath Nagar                           1
kg halli jalhalli west                  1
P Krishnappa Layout                     1
Vidyapeeta                              1
SARJAPUR BAGALUR ROAD                   1
J P Nagar 7th Phase Ramayya City        1
Basvasamithi Layout Vidyaranyapura      1
Thirumalashettyhally                    1
MRCR Layout                             1
Subbannaiah Palya                       1
Bapuji Nagar                            1
Thyagraj Nagar                          1
Sadahalli                               1
Jogupalya                               1
T K Reddy Layout                        1
Hal old airport road                    1
Banaswadi,                              1
BDS Layout                              1
Whietfield,                             1
Name: location, Length: 1287, dtype: int64

In [95]:
df5.location.count()

13056

In [101]:
location.values.sum()

13056

In [105]:
len(location[location>10])

239

In [106]:
len(location[location<10])

1033

In [107]:
df6=df5.copy()

In [108]:
df6['location']=df6.location.replace(len(location[location<10]),'other')

In [111]:
len(df6.location.unique())

1287

In [113]:
less_than_10=location[location<10]

In [115]:
df5.location=df5.location.apply(lambda x: 'other' if x in less_than_10 else x)

In [116]:
len(df5.location.unique())

255

In [118]:
df5.head(15)

                    location  total_sqft  bath   price  bhk  price_per_sqft
0   Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1           Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2                Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3         Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                   Kothanur      1200.0   2.0   51.00    2     4250.000000
5                 Whitefield      1170.0   2.0   38.00    2     3247.863248
6           Old Airport Road      2732.0   4.0  204.00    4     7467.057101
7               Rajaji Nagar      3300.0   4.0  600.00    4    18181.818182
8               Marathahalli      1310.0   3.0   63.25    3     4828.244275
9                      other      1020.0   6.0  370.00    6    36274.509804
10                Whitefield      1800.0   2.0   70.00    3     3888.888889
11                Whitefield      2785.0   5.0  295.00    4    10592.459605
12        7th Phase JP Nagar      1000.0   2.0   38.00    2     3800.000000
13                 Gottigere      1100.0   2.0   40.00    2     3636.363636
14                  Sarjapur      2250.0   3.0  148.00    3     6577.777778

In [119]:
df5[df5.total_sqft/df5.bhk<300].head()

               location  total_sqft  bath  price  bhk  price_per_sqft
9                 other      1020.0   6.0  370.0    6    36274.509804
45           HSR Layout       600.0   9.0  200.0    8    33333.333333
58        Murugeshpalya      1407.0   4.0  150.0    6    10660.980810
68  Devarachikkanahalli      1350.0   7.0   85.0    8     6296.296296
70                other       500.0   3.0  100.0    3    20000.000000

In [120]:
df5.shape

(13056, 6)

In [122]:
df6=df5[~(df5.total_sqft/df5.bhk<300)]
df6.shape

(12312, 6)

In [123]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out
df7 = remove_pps_outliers(df6)
df7.shape

(10120, 6)

In [124]:
def remove_bhk_outliers(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')
df8 = remove_bhk_outliers(df7)
# df8 = df7.copy()
df8.shape

(7259, 6)

In [125]:
df8[df8.bath>10]

            location  total_sqft  bath  price  bhk  price_per_sqft
583    BTM 1st Stage      3300.0  14.0  500.0    9    15151.515152
5288  Neeladri Nagar      4000.0  12.0  160.0   10     4000.000000
8449           other     12000.0  12.0  525.0   10     4375.000000
8535           other     10000.0  16.0  550.0   16     5500.000000
9230           other      6000.0  12.0  150.0   11     2500.000000
9541           other      5425.0  13.0  275.0   13     5069.124424

In [126]:
df8[df8.bath>df8.bhk+2]

           location  total_sqft  bath   price  bhk  price_per_sqft
583   BTM 1st Stage      3300.0  14.0   500.0    9    15151.515152
1627  Chikkabanavar      2460.0   7.0    80.0    4     3252.032520
5249     Nagasandra      7000.0   8.0   450.0    4     6428.571429
6720    Thanisandra      1806.0   6.0   116.0    3     6423.034330
8378          other     11338.0   9.0  1000.0    6     8819.897689

In [127]:

df9 = df8[df8.bath<df8.bhk+2]
df9.shape

(7186, 6)

In [129]:
df10 = df9.drop(['price_per_sqft'],axis='columns')
df10.head(3)

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3

In [130]:
dummies = pd.get_dummies(df10.location)
dummies.head(3)

,1st Block Jayanagar,1st Block Koramangala,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,...,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur,other
0,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [131]:
df11 = pd.concat([df10,dummies.drop('other',axis='columns')],axis='columns')
df11.head()

,location,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Block Koramangala,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,1st Block Jayanagar,2850.0,4.0,428.0,4,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1st Block Jayanagar,1630.0,3.0,194.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1st Block Jayanagar,1875.0,2.0,235.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1st Block Jayanagar,1200.0,2.0,130.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1st Block Jayanagar,1235.0,2.0,148.0,2,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [132]:
df12 = df11.drop('location',axis='columns')
df12.head(2)

,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Block Koramangala,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,2850.0,4.0,428.0,4,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1630.0,3.0,194.0,3,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [133]:
df12.shape

(7186, 258)

In [134]:
X=df12.drop(['price'],axis=1)

In [135]:
y=df12.price

In [136]:
X.shape

(7186, 257)

In [137]:
y.head(2)

0    428.0
1    194.0
Name: price, dtype: float64

In [138]:
X.head(2)

,total_sqft,bath,bhk,1st Block Jayanagar,1st Block Koramangala,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,2850.0,4.0,4,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1630.0,3.0,3,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [139]:
len(y)

7186

In [140]:
from sklearn.linear_model import LinearRegression

In [141]:
from sklearn.model_selection import train_test_split

In [144]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [146]:
lr_clf=LinearRegression()
lr_clf.fit(X_train,y_train)
lr_clf.score(X_test,y_test)

0.8485510445590524

In [154]:
def pred_price(location,sqft,bath,bhk):
    loc_index=np.where(X.columns=='location')[0]
    x=np.zeros(len(X.columns))
    x[0]=sqft
    x[1]=bath
    x[2]=bhk
    if loc_index>=0:
        x[loca_index]=1
    return lr_clf.predict([x])[0]

In [156]:
pred_price('1st Phase JP Nagar',1000,2,2)

C:\Users\asifk\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  import sys

81.64749257995848

In [157]:
import pickle

In [165]:
pickle.dump(lr_clf,open("ml_model.sav","wb"))

In [166]:
pickle.dump(lr_clf,open('ml_mode.sav','wb'))

In [167]:
with open('mlmodel.pickle','wb') as f:
    pickle.dump(lr_clf,f)

In [168]:
import json
columns={
    'data_columns':[col.lower() for col in X.columns]
}
with open('columns.json','w') as c:
    c.write(json.dumps(columns))